cmsis-svd/cmsis-svd/data/Infineon/s6e1b8xe.svd
        <!-- REGISTER "ADCMP_ACSC0" -->
        <register>
          <name>ADCMP_ACSC0</name>
          <description>ADCMP ch.0 Control Register C</description>
          <alternateGroup>ADCMP</alternateGroup>
          <addressOffset>0x1D4</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x1F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ADSEL" -->
            <field>
              <name>ADSEL</name>
              <description>Specify the destinations of ADC start signals that are output by ADCMP</description>
              <msb>4</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BUFE" -->
            <field>
              <name>BUFE</name>
              <description>Select enable/disable and transfer timing for buffer function of the ACMP register</description>
              <msb>1</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "ADCMP_ACSD0" -->
        <register>
          <name>ADCMP_ACSD0</name>
          <description>ADCMP ch.0 Control Register D</description>
          <alternateGroup>ADCMP</alternateGroup>
          <addressOffset>0x1D5</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xF3</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ZE" -->
            <field>
              <name>ZE</name>
              <description>Enables/disables the operation of the ADCMP when the FRT is "0x0000"</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UE" -->
            <field>
              <name>UE</name>
              <description>Enables/disables the operation of the ADCMP that is counting up for the connected FRT</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PE" -->
            <field>
              <name>PE</name>
              <description>Enables/disables the operation of the ADCMP that is counting down at the Peak value of the connected FRT</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DE" -->
            <field>
              <name>DE</name>
              <description>Enables/disables the operation of the ADCMP that is counting down for the connected FRT</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "OCUS" -->
            <field>
              <name>OCUS</name>
              <description>Selects the OCU OCCP register that will become the start for offset start</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AMOD" -->
            <field>
              <name>AMOD</name>
              <description>Selects operation mode for ADCMP</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "ADCMP_ACSC1" -->
        <register derivedFrom="ADCMP_ACSC0">
          <name>ADCMP_ACSC1</name>
          <description>ADCMP ch.1 Control Register C</description>
          <alternateGroup>ADCMP</alternateGroup>
          <addressOffset>0x1D8</addressOffset>
        </register>
        <!-- REGISTER "ADCMP_ACSD1" -->
        <register derivedFrom="ADCMP_ACSD0">
          <name>ADCMP_ACSD1</name>
          <description>ADCMP ch.1 Control Register D</description>
          <alternateGroup>ADCMP</alternateGroup>
          <addressOffset>0x1D9</addressOffset>
        </register>
        <!-- REGISTER "ADCMP_ACSC2" -->
        <register derivedFrom="ADCMP_ACSC0">
          <name>ADCMP_ACSC2</name>
          <description>ADCMP ch.2 Control Register C</description>
          <alternateGroup>ADCMP</alternateGroup>
          <addressOffset>0x1DC</addressOffset>
        </register>
        <!-- REGISTER "ADCMP_ACSD2" -->
        <register derivedFrom="ADCMP_ACSD0">
          <name>ADCMP_ACSD2</name>
          <description>ADCMP ch.2 Control Register D</description>
          <alternateGroup>ADCMP</alternateGroup>
          <addressOffset>0x1DD</addressOffset>
        </register>
        <!-- REGISTER "ADCMP_ACSC3" -->
        <register derivedFrom="ADCMP_ACSC0">
          <name>ADCMP_ACSC3</name>
          <description>ADCMP ch.3 Control Register C</description>
          <alternateGroup>ADCMP</alternateGroup>
          <addressOffset>0x1E0</addressOffset>
        </register>
        <!-- REGISTER "ADCMP_ACSD3" -->
        <register derivedFrom="ADCMP_ACSD0">
          <name>ADCMP_ACSD3</name>
          <description>ADCMP ch.3 Control Register D</description>
          <alternateGroup>ADCMP</alternateGroup>
          <addressOffset>0x1E1</addressOffset>
        </register>
        <!-- REGISTER "ADCMP_ACSC4" -->
        <register derivedFrom="ADCMP_ACSC0">
          <name>ADCMP_ACSC4</name>
          <description>ADCMP ch.4 Control Register C</description>
          <alternateGroup>ADCMP</alternateGroup>
          <addressOffset>0x1E4</addressOffset>
        </register>
        <!-- REGISTER "ADCMP_ACSD4" -->
        <register derivedFrom="ADCMP_ACSD0">
          <name>ADCMP_ACSD4</name>
          <description>ADCMP ch.4 Control Register D</description>
          <alternateGroup>ADCMP</alternateGroup>
          <addressOffset>0x1E5</addressOffset>
        </register>
        <!-- REGISTER "ADCMP_ACSC5" -->
        <register derivedFrom="ADCMP_ACSC0">
          <name>ADCMP_ACSC5</name>
          <description>ADCMP ch.5 Control Register C</description>
          <alternateGroup>ADCMP</alternateGroup>
          <addressOffset>0x1E8</addressOffset>
        </register>
        <!-- REGISTER "ADCMP_ACSD5" -->
        <register derivedFrom="ADCMP_ACSD0">
          <name>ADCMP_ACSD5</name>
          <description>ADCMP ch.5 Control Register D</description>
          <alternateGroup>ADCMP</alternateGroup>
          <addressOffset>0x1E9</addressOffset>
        </register>
