cmsis-svd/cmsis-svd/data/Infineon/s6e1b8xe.svd
    <!-- PERIPHERAL "BT2" -->
    <peripheral derivedFrom="BT0">
      <name>BT2</name>
      <baseAddress>0x40025080</baseAddress>
      <description>Base Timer 2</description>
      <version>A</version>
      <!-- INTERRUPT "BT0_7_FLASHIF" -->
      <interrupt>
        <name>BT0_7_FLASHIF</name>
        <value>31</value>
      </interrupt>
    </peripheral>
    <!-- PERIPHERAL "BT3" -->
    <peripheral derivedFrom="BT0">
      <name>BT3</name>
      <baseAddress>0x400250C0</baseAddress>
      <description>Base Timer 3</description>
      <version>A</version>
      <!-- INTERRUPT "BT0_7_FLASHIF" -->
      <interrupt>
        <name>BT0_7_FLASHIF</name>
        <value>31</value>
      </interrupt>
    </peripheral>
    <!-- PERIPHERAL "BT4" -->
    <peripheral derivedFrom="BT0">
      <name>BT4</name>
      <baseAddress>0x40025200</baseAddress>
      <description>Base Timer 4</description>
      <version>A</version>
      <!-- INTERRUPT "BT0_7_FLASHIF" -->
      <interrupt>
        <name>BT0_7_FLASHIF</name>
        <value>31</value>
      </interrupt>
    </peripheral>
    <!-- PERIPHERAL "BT5" -->
    <peripheral derivedFrom="BT0">
      <name>BT5</name>
      <baseAddress>0x40025240</baseAddress>
      <description>Base Timer 5</description>
      <version>A</version>
      <!-- INTERRUPT "BT0_7_FLASHIF" -->
      <interrupt>
        <name>BT0_7_FLASHIF</name>
        <value>31</value>
      </interrupt>
    </peripheral>
    <!-- PERIPHERAL "BT6" -->
    <peripheral derivedFrom="BT0">
      <name>BT6</name>
      <baseAddress>0x40025280</baseAddress>
      <description>Base Timer 6</description>
      <version>A</version>
      <!-- INTERRUPT "BT0_7_FLASHIF" -->
      <interrupt>
        <name>BT0_7_FLASHIF</name>
        <value>31</value>
      </interrupt>
    </peripheral>
    <!-- PERIPHERAL "BT7" -->
    <peripheral derivedFrom="BT0">
      <name>BT7</name>
      <baseAddress>0x400252C0</baseAddress>
      <description>Base Timer 7</description>
      <version>A</version>
      <!-- INTERRUPT "BT0_7_FLASHIF" -->
      <interrupt>
        <name>BT0_7_FLASHIF</name>
        <value>31</value>
      </interrupt>
    </peripheral>
    <!-- PERIPHERAL "BTIOSEL03" -->
    <peripheral>
      <name>BTIOSEL03</name>
      <description>Base Timer I/O Select</description>
      <version>A</version>
      <groupName>BTIOSEL03</groupName>
      <baseAddress>0x40025100</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "BTSEL0123" -->
        <register>
          <name>BTSEL0123</name>
          <description>I/O Select Register</description>
          <addressOffset>0x00</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFF00</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SEL23" -->
            <field>
              <name>SEL23</name>
              <description>I/O select bits for Ch.2/Ch.3</description>
              <msb>15</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SEL01" -->
            <field>
              <name>SEL01</name>
              <description>I/O select bits for Ch.0/Ch.1</description>
              <msb>11</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <!-- PERIPHERAL "BTIOSEL47" -->
    <peripheral>
      <name>BTIOSEL47</name>
      <description>Base Timer I/O Select</description>
      <version>A</version>
      <groupName>BTIOSEL47</groupName>
      <baseAddress>0x40025300</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "BTSEL4567" -->
        <register>
          <name>BTSEL4567</name>
          <description>I/O Select Register</description>
          <addressOffset>0x00</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFF00</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SEL67" -->
            <field>
              <name>SEL67</name>
              <description>I/O select bits for Ch.6/Ch.7</description>
              <msb>15</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SEL45" -->
            <field>
              <name>SEL45</name>
              <description>I/O select bits for Ch.4/Ch.5</description>
              <msb>11</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <!-- PERIPHERAL "SBSSR" -->
    <peripheral>
      <name>SBSSR</name>
      <description>Software-based Simultaneous Startup Register</description>
      <version>A</version>
      <groupName>SBSSR</groupName>
      <baseAddress>0x40025F00</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0FC</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "BTSSSR" -->
        <register>
          <name>BTSSSR</name>
          <description>Software-based Simultaneous Startup Register</description>
          <addressOffset>0xFC</addressOffset>
          <size>16</size>
          <access>write-only</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x000F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SSSR3" -->
            <field>
              <name>SSSR3</name>
              <description>Software-based simultaneous startup bit of Ch.3</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "SSSR2" -->
            <field>
              <name>SSSR2</name>
              <description>Software-based simultaneous startup bit of Ch.2</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "SSSR1" -->
            <field>
              <name>SSSR1</name>
              <description>Software-based simultaneous startup bit of Ch.1</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "SSSR0" -->
            <field>
              <name>SSSR0</name>
              <description>Software-based simultaneous startup bit of Ch.0</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
