cmsis-svd/cmsis-svd/data/Infineon/s6e1b8xe.svd
      </registers>
    </peripheral>
    <!-- PERIPHERAL "MFSI2S1" -->
    <peripheral derivedFrom="MFSI2S0">
      <name>MFSI2S1</name>
      <baseAddress>0x4003CA80</baseAddress>
      <description>I2S1 Registers</description>
      <version>A</version>
    </peripheral>
    <!-- PERIPHERAL "USB0" -->
    <peripheral>
      <name>USB0</name>
      <description>USB0 Function</description>
      <version>A</version>
      <groupName>USB</groupName>
      <baseAddress>0x40042100</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x4</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x8</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xC</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x10</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x14</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x18</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x1C</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x20</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x24</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x28</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x2C</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x30</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x34</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x38</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x3C</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x40</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x44</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x48</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x4C</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x50</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x54</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x58</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x5C</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x60</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x64</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x68</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x6C</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x70</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x74</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- INTERRUPT "USB0_F" -->
      <interrupt>
        <name>USB0_F</name>
        <value>26</value>
      </interrupt>
      <!-- INTERRUPT "USB0_F_MFT0_ICU" -->
      <interrupt>
        <name>USB0_F_MFT0_ICU</name>
        <value>29</value>
      </interrupt>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "HCNT0" -->
        <register>
          <name>HCNT0</name>
          <description>Host Control Register 0</description>
          <addressOffset>0x00</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RWKIRE" -->
            <field>
              <name>RWKIRE</name>
              <description>resume interrupt enable bit</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "URIRE" -->
            <field>
              <name>URIRE</name>
              <description>bus reset interrupt enable bit</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CMPIRE" -->
            <field>
              <name>CMPIRE</name>
              <description>token completion interrupt enable bit</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CNNIRE" -->
            <field>
              <name>CNNIRE</name>
              <description>device connection detection interrupt enable bit</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DIRE" -->
            <field>
              <name>DIRE</name>
              <description>device disconnection detection interrupt enable bit</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SOFIRE" -->
            <field>
              <name>SOFIRE</name>
              <description>SOF interrupt enable bit</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "URST" -->
            <field>
              <name>URST</name>
              <description>bus reset bit</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "HOST" -->
            <field>
              <name>HOST</name>
              <description>host mode bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "HCNT1" -->
        <register>
          <name>HCNT1</name>
          <description>Host Control Register 1</description>
          <addressOffset>0x01</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x01</resetValue>
          <resetMask>0x07</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SOFSTEP" -->
            <field>
              <name>SOFSTEP</name>
              <description>SOF interrupt occurrence selection bit</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CANCEL" -->
            <field>
              <name>CANCEL</name>
              <description>token cancellation enable bit</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RETRY" -->
            <field>
              <name>RETRY</name>
              <description>retry enable bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "HIRQ" -->
        <register>
          <name>HIRQ</name>
          <description>Host Interrupt Register</description>
          <addressOffset>0x04</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xBF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TCAN" -->
            <field>
              <name>TCAN</name>
              <description>token cancellation flag</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RWKIRQ" -->
            <field>
              <name>RWKIRQ</name>
              <description>remote Wake-up end flag</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "URIRQ" -->
            <field>
              <name>URIRQ</name>
              <description>bus reset end flag</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CMPIRQ" -->
            <field>
              <name>CMPIRQ</name>
              <description>token completion flag</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CNNIRQ" -->
            <field>
              <name>CNNIRQ</name>
              <description>device connection detection flag</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DIRQ" -->
            <field>
              <name>DIRQ</name>
              <description>device disconnection detection flag</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SOFIRQ" -->
            <field>
              <name>SOFIRQ</name>
              <description>SOF starting flag</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "HERR" -->
        <register>
          <name>HERR</name>
          <description>Host Error Status Register</description>
          <addressOffset>0x05</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x03</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "LSTSOF" -->
            <field>
              <name>LSTSOF</name>
              <description>lost SOF flag</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RERR" -->
            <field>
              <name>RERR</name>
              <description>receive error flag</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TOUT" -->
            <field>
              <name>TOUT</name>
              <description>timeout flag</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CRC" -->
            <field>
              <name>CRC</name>
              <description>CRC error flag</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TGERR" -->
            <field>
              <name>TGERR</name>
              <description>toggle error flag</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "STUFF" -->
            <field>
              <name>STUFF</name>
              <description>stuffing error flag</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "HS" -->
            <field>
              <name>HS</name>
              <description>handshake status flags</description>
              <msb>1</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "HSTATE" -->
        <register>
          <name>HSTATE</name>
          <description>Host Status Register</description>
          <addressOffset>0x08</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x12</resetValue>
          <resetMask>0x3F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ALIVE" -->
            <field>
              <name>ALIVE</name>
              <description>specify the keep-alive function in the low-speed mode</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CLKSEL" -->
            <field>
              <name>CLKSEL</name>
              <description>USB operation clock selection bit</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SOFBUSY" -->
            <field>
              <name>SOFBUSY</name>
              <description>SOF busy flag</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SUSP" -->
            <field>
              <name>SUSP</name>
              <description>suspend setting bit</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TMODE" -->
            <field>
              <name>TMODE</name>
              <description>transmission mode flag</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "CSTAT" -->
            <field>
              <name>CSTAT</name>
              <description>connection status flag</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "HFCOMP" -->
        <register>
          <name>HFCOMP</name>
          <description>SOF Interrupt Frame Compare Register</description>
          <addressOffset>0x09</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "FRAMECOMP" -->
            <field>
              <name>FRAMECOMP</name>
              <description>frame compare data</description>
              <msb>7</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "HRTIMER" -->
        <register>
          <name>HRTIMER</name>
          <description>Retry Timer Setup Register</description>
          <addressOffset>0x0C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RTIMER" -->
            <field>
              <name>RTIMER</name>
              <description>retry timer setting</description>
              <msb>15</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "HRTIMER2" -->
        <register>
          <name>HRTIMER2</name>
          <description>Retry Timer Setup Register 2</description>
          <addressOffset>0x10</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x03</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RTIMER2" -->
            <field>
              <name>RTIMER2</name>
              <description>retry timer setting 2</description>
              <msb>1</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "HADR" -->
        <register>
          <name>HADR</name>
          <description>Host Address Register</description>
          <addressOffset>0x11</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x7F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ADDRESS" -->
            <field>
              <name>ADDRESS</name>
              <description>Host Address</description>
              <msb>6</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
